# Напишите программу, которая принимает на вход координаты двух точек 
# и находит расстояние между ними в 2D пространстве.

# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

a = []
b = []

for _ in range(2):
 k = int(input("Введите координаты точки А: "))
 a.append(k)
 f = int(input("Введите координаты точки В: "))
 b.append(f)
result = ((b[0] - a[0]) ** 2 + (b[1] - a[1]) ** 2) ** (0.5)

print("%.2f" % result)